# default utilities
brew "curl"
brew "git"
# GPG is installed by GPG Suite on macOS
brew "gpg" unless system '[ -x /usr/local/bin/gpg ]'
brew "rsync"
brew "wget"

# replacements of default utilities
brew "bat" # Better cat
brew "exa" # Better ls
brew "fd" # Better find
brew "htop" # Better top
brew "httpie" # Better curl
brew "ripgrep" # Better grep

# command line tools
brew "fzf" # Fuzzy finder
brew "gifsicle" # Gif tool
brew "hugo" # Static site builder
brew "magic-wormhole" # Point-to-point file sharing
brew "nnn" # Command-line file browser
brew "scc" # Lines of code counter
brew "ssh-copy-id"
brew "tig" # Visual Git client
brew "unzip"

# shell
brew "bash"
brew "zsh"
brew "zsh-syntax-highlighting"

# programming languages
brew "go"
brew "php"
brew "python"
brew "ruby"
brew "rust"

# programming language tools
brew "composer" # PHP
brew "dep" # Golang
brew "nodenv" # Node environment manager
brew "nodenv/nodenv/nodenv-default-packages" # Plugin for auto-installing list of npm packages
brew "nodenv/nodenv/nodenv-package-rehash" # Plugin for auto-rehashing when a global package is installed or uninstalled
brew "shellcheck" # Shell script linter
brew "shfmt" # Shell script formatter

# web service clients
tap "github/gh"
brew "github/gh/gh" # GitHub
brew "hub", args: ["HEAD"] # GitHub

# macOS-only  command line tools
brew "gnu-getopt" if OS.mac? # Better than BSD getopt
brew "gnu-sed" if OS.mac? # Better than BSD sed
brew "gnu-time" if OS.mac? # Better than BSD time
brew "grep" if OS.mac?

# applications
cask "docker"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "kap"
cask "qlmarkdown"
cask "sketch"
cask "visual-studio-code"
cask "figma"
cask "parallels"
cask "cleanmymac"
cask "kaleidoscope"
cask "iterm2"
cask "tower"
cask "mas"
cask "paw"

# fonts
tap "homebrew/cask-fonts"
cask "font-abril-fatface"
cask "font-arvo"
cask "font-bitter"
cask "font-blokk-neue"
cask "font-fira-code"
cask "font-hasklig"
cask "font-lato"
cask "font-lora"
cask "font-merriweather"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-playfair-display"
cask "font-source-code-pro"
